import thumbnail_20160201 from '../../assets/images/blog/20160201.jpg';
import thumbnail_20160124 from '../../assets/images/blog/20160124.jpg';
import thumbnail_20160101 from '../../assets/images/blog/20160101.jpg';
import thumbnail_20151221 from '../../assets/images/blog/20151221.jpeg';
import thumbnail_20151213 from '../../assets/images/blog/20151213.jpg';

const content_20160201 = "数日前に雪が降るほど寒かったとは想像できないぐらいに暖かい沖縄です。気温は21度、風がなければ春のような陽気を感じます。春と言えば桜。沖縄北部では各地で桜祭りが開催されています。古宇利島からすぐ近くの今帰仁城跡では2月7日までライトアップされており、桜と城壁が明るく照らし出されます。八重岳の桜祭りも2月7日までとなっています。古宇利島へいらした際には是非立ち寄ってみてください。";
const content_20160124 = "沖縄、非常に寒いです。沖縄県国頭郡奥で5.8度を観測したようで、この気温は1月史上最低気温だそうです。沖縄本島には低温注意報が出ているようです。「低温注意報」初めて聞きました。一番寒くなるのが今晩から明朝にかけてのようです。備えましょう。雪が降るかも？！と賑わっており、実際に「あられ、みぞれが降った！」とネットでは出ていますが、今のところ気象庁の観測はなし。もし降ると39年前に7.1度であられが降った以来のようです。古宇利島は風が強く海も大荒れ。橋の上は強風で車のハンドルがとられそうになります。ご注意ください。";
const content_20160101 = "明けましておめでとうございます。古宇利島の護岸から眺める初日の出です。（今年は早起きできました。）古宇利島ではこの護岸や橋の上からたくさんの人が初日の出を見に来ていました。お天気もよくきれいな初日の出に感動し、日が昇り出すと古宇利島らしい青い海が見れました。年々来島者が増えているようですが、これからまだまだ増えていきそうですね。このサイトを通じて、島を知る方、より楽しめるようになる方が増えていくことを願いながら、「島の日々」を更新していきますので、今年もよろしくお願いします。";
const content_20151221 = "こんにちは。沖縄も寒くなったなーと思ったらまた暖かくなりました。今日の最高気温は25度。半袖にビーチサンダルでオッケーです。ちなみに朝からシュノーケルしてきました。透明度抜群で最高に気持ち良かったです。今更気づいたのですが、南風が吹くと古宇利大橋周辺の海はとても穏やかです。波が立たないので、橋からのぞくと海の底まで見えちゃいます。運が良ければウミガメが泳いでいる姿も見れるかもしれません。古宇利島を撮影しに来る際は天気予報と一緒に風向きもチェックして来るといいかもしれませんね。";
const content_20151213 = "今年は非常に暖かい日が続いています。沖縄といえども暖かすぎます。いったいいつ寒くなるのやら。まだまだ半袖で過ごせる気候です。今日の写真は古宇利大橋で見る夕日と夕焼け空です。前回の更新でお知らせした古宇利マジックアワーRUNの見所となるのがこの景色となります。（雨じゃなければ…。）海沿い、橋の上ということで天気や風に左右されやすい上になかなかのアップダウンが続くコースということですが、昨年走っていた人たちはとても気持ちよさそうでした。この景色はマラソン好きにはたまらないでしょうね。ハーフマラソンということもあり初心者でも比較的参加しやすいのでは。まだまだ募集しているようですよ〜。エントリーは先着順のようなのでまだの方は是非。";


const articleDataset = {
    "main_article": {
        contents: [
            {thumbnail: thumbnail_20160201, title: "沖縄では桜祭りが開催されています！", day: "2016年02月01日", text: content_20160201},
            {thumbnail: thumbnail_20160124, title: "沖縄なのに寒すぎる。", day: "2016年01月24日", text: content_20160124},
            {thumbnail: thumbnail_20160101, title: "明けましておめでとうございます。", day: "2016年01月01日", text: content_20160101},
            {thumbnail: thumbnail_20151221, title: "南風で暖かい一日。", day: "2015年12月21日", text: content_20151221},
            {thumbnail: thumbnail_20151213, title: "古宇利大橋から見る今日の夕日", day: "2015年12月13日", text: content_20151213},
        ],
    },
    "new_article": {
        contents: [
            {title: "沖縄では桜祭りが開催されています！", day: "2016.02.01"},
            {title: "沖縄なのに寒すぎる。", day: "2016.01.24"},
            {title: "明けましておめでとうございます。", day: "2016.01.01"},
            {title: "南風で暖かい一日。", day: "2015.12.21"},
            {title: "古宇利大橋から見る今日の夕日", day: "2015.12.13"},
            {title: "第6回古宇利島マジックアワーRUN エントリー受付中！", day: "2015.12.07"},
            {title: "ちぐぬ浜の青い海", day: "2015.11.29"},
            {title: "ざわわざわわ", day: "2015.11.24"},
            {title: "古宇利大橋から見る朝焼けと穏やかな海", day: "2015.11.16"},
            {title: "全島角力大会・芸能花火ショー", day: "2015.10.16"},
        ],
    },
}

export default articleDataset;